#pragma once

/**
 * Name: Operation__Harsh_Doorstop
 * Version: 1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class DonkehFramework.DFCfgDataManager
	 * Size -> 0x0050 (FullSize[0x0078] - InheritedSize[0x0028])
	 */
	class UDFCfgDataManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_L70B[0x50];                                  // 0x0028(0x0050) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFMapRotationManager
	 * Size -> 0x0018 (FullSize[0x0090] - InheritedSize[0x0078])
	 */
	class UDFMapRotationManager : public UDFCfgDataManager
	{
	public:
		unsigned char                                              UnknownData_RGT5[0x18];                                  // 0x0078(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFPlayerAdminList
	 * Size -> 0x0050 (FullSize[0x00C8] - InheritedSize[0x0078])
	 */
	class UDFPlayerAdminList : public UDFCfgDataManager
	{
	public:
		unsigned char                                              UnknownData_5BYB[0x50];                                  // 0x0078(0x0050) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFPlayerBanList
	 * Size -> 0x0050 (FullSize[0x00C8] - InheritedSize[0x0078])
	 */
	class UDFPlayerBanList : public UDFCfgDataManager
	{
	public:
		unsigned char                                              UnknownData_LGIG[0x50];                                  // 0x0078(0x0050) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFPlayerWhitelist
	 * Size -> 0x0050 (FullSize[0x00C8] - InheritedSize[0x0078])
	 */
	class UDFPlayerWhitelist : public UDFCfgDataManager
	{
	public:
		unsigned char                                              UnknownData_KM31[0x50];                                  // 0x0078(0x0050) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFAssetManager
	 * Size -> 0x0008 (FullSize[0x0440] - InheritedSize[0x0438])
	 */
	class UDFAssetManager : public UAssetManager
	{
	public:
		unsigned char                                              UnknownData_QULF[0x8];                                   // 0x0438(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseAIController
	 * Size -> 0x0008 (FullSize[0x0330] - InheritedSize[0x0328])
	 */
	class ADFBaseAIController : public AAIController
	{
	public:
		unsigned char                                              UnknownData_ZZ0L[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (PADDING)

	public:
		bool CanRestartPlayer();
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseItem
	 * Size -> 0x0188 (FullSize[0x03A8] - InheritedSize[0x0220])
	 */
	class ADFBaseItem : public AActor
	{
	public:
		class ADFBaseCharacter*                                    PawnOwner;                                               // 0x0220(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UStaticMeshComponent*                                ItemMesh;                                                // 0x0228(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UStaticMeshComponent*                                ItemMesh1P;                                              // 0x0230(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class USkeletalMesh*                                       PawnMesh1P;                                              // 0x0238(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              PawnMesh1PAnimClass;                                     // 0x0240(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FVector                                             PawnMesh1PLocationOffset;                                // 0x0248(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FRotator                                            PawnMesh1PRotationOffset;                                // 0x0254(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		EItemType                                                  ItemType;                                                // 0x0260(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ESpecificItemType                                          SpecificItemType;                                        // 0x0261(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bCanEquip : 1;                                           // 0x0262(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bCanAimWhileEquipped : 1;                                // 0x0262(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bDisableFireInput : 1;                                   // 0x0262(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bEquipped : 1;                                           // 0x0262(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bPendingEquip : 1;                                       // 0x0262(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bPendingUnEquip : 1;                                     // 0x0262(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bWantsToFire : 1;                                        // 0x0262(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_SEJG[0x15];                                  // 0x0263(0x0015) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bDebug : 1;                                              // 0x0278(0x0001) BIT_FIELD Edit, BlueprintVisible, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NTK6[0x7];                                   // 0x0279(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FCharacterAnimCollection                            CharacterAnimCollection;                                 // 0x0280(0x0128) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		void StopFire();
		void StartFire();
		void SetOwningPawn(class ADFBaseCharacter* NewOwner);
		void SetMeshVisibility(bool bFirstPerson);
		void ServerStopFire();
		void ServerStartFire();
		bool RemoveLegacyLocomotionAnims(bool bFPP);
		void ReceiveVisibilityChanged(bool bFirstPerson);
		void ReceiveStopFire();
		void ReceiveStartFire();
		void ReceiveOnUnEquipFinished(bool bLeavingPawnInventory);
		void ReceiveOnUnEquip(bool bPlayAnimAndWait, bool bLeavingPawnInventory);
		void ReceiveOnTurnOff();
		void ReceiveOnLeaveInventory(class ADFBaseCharacter* LastOwner);
		void ReceiveOnEquipFinished();
		void ReceiveOnEquip(class ADFBaseItem* LastItem);
		void ReceiveOnEnterInventory(class ADFBaseCharacter* NewOwner, class ADFBaseCharacter* LastOwner);
		bool OwnerIsSprinting();
		bool OwnerIsAiming();
		void OnUnEquip(bool bPlayAnimAndWait, bool bLeavingPawnInventory);
		void OnTurnOff();
		void OnRep_PawnOwner(class ADFBaseCharacter* LastOwner);
		void OnLeaveInventory(class ADFBaseCharacter* LastOwner);
		void OnEquip(class ADFBaseItem* LastItem);
		void OnEnterInventory(class ADFBaseCharacter* NewOwner, class ADFBaseCharacter* LastOwner);
		bool IsUnEquipping();
		bool IsEquipping();
		bool IsEquipped();
		bool IsClientSimulated();
		ESpecificItemType GetSpecificItemType();
		class ADFBaseCharacter* GetPawnOwner();
		class UDFInventoryComponent* GetPawnInventory();
		struct FRotator GetOwnerViewRotation();
		bool GetOwnerViewPoint(struct FVector* OutViewLoc, struct FRotator* OutViewRot);
		struct FVector GetOwnerViewLocation();
		TMap<class FName, class UAnimSequenceBase*> GetLegacyLocomotionAnims(bool bFPP);
		EItemType GetItemType();
		class UStaticMeshComponent* GetItemMeshToUse(bool bIgnoreLocalControlOnServer);
		class UStaticMeshComponent* GetItemMesh1P();
		class UStaticMeshComponent* GetItemMesh();
		struct FVector GetAdjustedAimDirection();
		bool CanSprintWhileEquipped();
		bool CanFire();
		bool CanEquip();
		bool CanAimWhileEquipped();
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseAmmoClip
	 * Size -> 0x0018 (FullSize[0x03C0] - InheritedSize[0x03A8])
	 */
	class ADFBaseAmmoClip : public ADFBaseItem
	{
	public:
		class ADFBaseGun*                                          GunOwner;                                                // 0x03A8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    CurrentClipAmmo;                                         // 0x03B0(0x0004) Edit, BlueprintVisible, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    StartingClipAmmo;                                        // 0x03B4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    MaxClipAmmo;                                             // 0x03B8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_COGM[0x4];                                   // 0x03BC(0x0004) MISSED OFFSET (PADDING)

	public:
		int32_t STATIC_StoreAmmoInInventory(class UDFInventoryComponent* AmmoStore, int32_t AmmoAmt, class UClass* AmmoType);
		void StoreAmmo(int32_t AmmoToStore);
		void SetOwningGun(class ADFBaseGun* NewOwner);
		bool IsLoaded();
		int32_t GetStartingClipAmmo();
		int32_t GetMaxClipAmmo();
		class ADFBaseGun* GetGunOwner();
		int32_t GetCurrentClipAmmo();
		void ConsumeAmmo(int32_t AmmoToConsume);
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseCharacter
	 * Size -> 0x0440 (FullSize[0x0900] - InheritedSize[0x04C0])
	 */
	class ADFBaseCharacter : public ACharacter
	{
	public:
		unsigned char                                              RemoteViewYaw;                                           // 0x04C0(0x0001) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GB59[0x7];                                   // 0x04C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bClientResimulateSprintStamina : 1;                      // 0x04C8(0x0001) BIT_FIELD Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4BAG[0x7];                                   // 0x04C9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FCharacterAnimCollection                            DefaultPawnAnimCollection;                               // 0x04D0(0x0128) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                       bPlayFootstepFXWithPerspMeshOnly : 1;                    // 0x05F8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTickAllAnimationOnDedicatedServer : 1;                  // 0x05F8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bOnlyTickAnimMontagesOnDedicatedServer : 1;              // 0x05F8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UZNA[0x7];                                   // 0x05F9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FCharacterSoundCollection                           DefaultPawnSoundCollection;                              // 0x0600(0x0010) Edit, BlueprintVisible, NoDestructor, Protected, NativeAccessSpecifierProtected
		class ADFBaseItem*                                         EquippedItem;                                            // 0x0610(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class ADFBaseItem*                                         LastEquippedItem;                                        // 0x0618(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             OnEquippedItemChanged;                                   // 0x0620(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FName                                                ItemAttachPoint;                                         // 0x0630(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDFInventoryComponent*                               Inventory;                                               // 0x0638(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDFLoadout*                                          DefaultLoadout;                                          // 0x0640(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EDFItemEnabledMode                                         ItemEnabledMode;                                         // 0x0648(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bDying : 1;                                              // 0x0649(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q2BV[0x6];                                   // 0x064A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnHealthChanged;                                         // 0x0650(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		float                                                      Health;                                                  // 0x0660(0x0004) Edit, BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_B6US[0x14];                                  // 0x0664(0x0014) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RagdollLifeSpan;                                         // 0x0678(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_F6L7[0x4];                                   // 0x067C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnCharacterDeath;                                        // 0x0680(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		float                                                      MaxHealth;                                               // 0x0690(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VMVV[0x4];                                   // 0x0694(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTakeHitInfo                                        LastTakeHitInfo;                                         // 0x0698(0x0120) Edit, Net, Transient, EditConst, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_OHQ4[0x8];                                   // 0x07B8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class FName, float>                                   BoneDamageMultipliers;                                   // 0x07C0(0x0050) Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		bool                                                       bApplyDamageMomentumOnHit : 1;                           // 0x0810(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_53YK[0x7];                                   // 0x0811(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnSprintTransition;                                      // 0x0818(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnAimTransition;                                         // 0x0828(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnLeanTransition;                                        // 0x0838(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnVaultTransition;                                       // 0x0848(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		ECharacterStance                                           ReplicatedStance;                                        // 0x0858(0x0001) Edit, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ECharacterStance                                           PreviousStance;                                          // 0x0859(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bPressedVault : 1;                                       // 0x085A(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSprinting : 1;                                          // 0x085A(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAiming : 1;                                             // 0x085A(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsProne : 1;                                            // 0x085A(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bVaulting : 1;                                           // 0x085A(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bWasVaulting : 1;                                        // 0x085A(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MMMN[0x1];                                   // 0x085B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDFVaultTraceResult                                 PendingVaultTraceResult;                                 // 0x085C(0x001C) Transient, NoDestructor, Protected, NativeAccessSpecifierProtected
		struct FDFVaultTraceData                                   VaultParams;                                             // 0x0878(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected
		float                                                      ReplicatedLeanAmount;                                    // 0x0890(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RPHG[0x4];                                   // 0x0894(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDFCharacterLeanHandler*                             LeanHandler;                                             // 0x0898(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoClear, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UDFCharacterMovementComponent*                       DFCharacterMovement;                                     // 0x08A0(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TargetEyeHeight;                                         // 0x08A8(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       UnknownData_2P2Z : 1;                                    // 0x08AC(0x0001) BIT_FIELD (PADDING)
		bool                                                       bInterpCrouchedEyeHeight : 1;                            // 0x08AC(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RXZP[0x3];                                   // 0x08AD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CrouchedTransitionInterpSpeed;                           // 0x08B0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInterpProneEyeHeight : 1;                               // 0x08B4(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0LV3[0x3];                                   // 0x08B5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ProneTransitionInterpSpeed;                              // 0x08B8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ProneEyeHeight;                                          // 0x08BC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              TeamNum;                                                 // 0x08C0(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_IJUQ[0x7];                                   // 0x08C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ADFTeamState*                                        TeamState;                                               // 0x08C8(0x0008) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class ADFTeamState*                                        PrevTeamState;                                           // 0x08D0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bAllowTeamIdOverride : 1;                                // 0x08D8(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AUCQ[0x7];                                   // 0x08D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnPawnTeamNumUpdated;                                    // 0x08E0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPawnTeamStateUpdated;                                  // 0x08F0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		void Vault();
		void UnSprint(bool bClientSimulation);
		void UnLean(ELeanDirection UnDesiredLeanDir, bool bClientSimulation);
		void UnAim(bool bClientSimulation);
		void Suicide();
		void StopVaulting();
		void StopFire();
		void StopCharacterPerspectiveAnimation(const struct FPerspectiveAnim& CharAnim);
		void StopCharacterMontage(class UAnimMontage* CharMontage);
		void StopAllAnimMontages(bool bPerspectiveMeshOnly);
		void StartFire();
		void SprintToggle();
		void Sprint(bool bClientSimulation);
		void SpawnHitImpactFX(float DamageTaken, const struct FDamageEvent& DamageEvent, class APawn* PawnInstigator, class AActor* DamageCauser);
		void SetRagdollPhysics();
		void SetItemEnabledMode(EDFItemEnabledMode ItemMode);
		void SetHealth(float InHealth);
		void ServerSuicide();
		void ServerEquipItem(class ADFBaseItem* ItemToEquip);
		void ServerDoVault(const struct FDFVaultTraceData& VaultStartParams);
		void Reload();
		void ReceiveRestart();
		void ReceivePlayHit(float DamageTaken, const struct FDamageEvent& DamageEvent, class APawn* PawnInstigator, class AActor* DamageCauser, bool bKilled);
		void ReceivePawnTeamStateUpdated(class ADFTeamState* TeamStateBeforeUpdate, class ADFTeamState* NewTeamState, bool bNewTeamStateInit);
		void ReceivePawnTeamNumUpdated(unsigned char LastTeamNum, unsigned char NewTeamNum);
		void ReceiveOnStartVault();
		void ReceiveOnStartSprint();
		void ReceiveOnStartProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
		void ReceiveOnStartLean();
		void ReceiveOnStartAim();
		void ReceiveOnRepPlayerState();
		void ReceiveOnEndVault();
		void ReceiveOnEndSprint();
		void ReceiveOnEndProne(float HalfHeightAdjust, float ScaledHalfHeightAdjust);
		void ReceiveOnEndLean();
		void ReceiveOnEndAim();
		void ReceiveHealthChanged(float NewHealthTotal, float PrevHealthTotal);
		void ReceiveEquippedItemChanged(class ADFBaseItem* NewEquippedItem, class ADFBaseItem* PrevEquippedItem);
		void ProneToggle();
		float PlayCharacterUnEquipMontage(class UAnimMontage* UnEquipMontageToPlay);
		float PlayCharacterThrowUnderhandMontage(class UAnimMontage* ThrowUnderhandMontageToPlay);
		float PlayCharacterThrowOverhandMontage(class UAnimMontage* ThrowOverhandMontageToPlay);
		float PlayCharacterStartReloadMontage(class UAnimMontage* StartReloadMontageToPlay, bool bDryReload);
		class UAudioComponent* PlayCharacterSound(const struct FPerspectiveSound& Sound);
		float PlayCharacterReloadMontage(bool bDryReload);
		float PlayCharacterPerspectiveAnimation(const struct FPerspectiveAnim& CharAnim, bool bForceDisableAutoBlendOut);
		float PlayCharacterMontage(class UAnimMontage* CharMontage, bool bForceDisableAutoBlendOut);
		float PlayCharacterFireMontage(class UAnimMontage* FireMontageToPlay, bool bFireLast, bool bFireADS);
		float PlayCharacterEquipMontage(bool bDontPlayAndReturnDominantPlayLengthOnly);
		float PlayCharacterEndReloadMontage(class UAnimMontage* EndReloadMontageToPlay, bool bDryReload);
		float PlayCharacterDeathMontage(bool bDontPlayAndReturnDominantPlayLengthOnly);
		float PlayCharacterCockMontage(class UAnimMontage* CockMontageToPlay);
		float PlayCharacterActionMontage(class UAnimMontage* ActionMontageToPlay);
		void OnRep_TeamState(class ADFTeamState* TeamStateBeforeUpdate);
		void OnRep_TeamNum(unsigned char LastTeamNum);
		void OnRep_ReplicatedStance();
		void OnRep_ReplicatedLeanAmount(float LastReplicatedLeanAmount);
		void OnRep_LastTakeHitInfo();
		void OnRep_ItemEnabledMode(EDFItemEnabledMode PreviousItemEnabledMode);
		void OnRep_IsProne();
		void OnRep_Health(float PreviousValue);
		void OnRep_EquippedItem(class ADFBaseItem* LastItem);
		void OnRep_bSprinting();
		void OnRep_bAiming();
		void OnDeath(float KillingDamage, const struct FDamageEvent& DamageEvent, class APawn* InstigatingPawn, class AActor* DamageCauser);
		void LeaveProne(bool bClientSimulation);
		void LeanToggle(ELeanDirection LeanDir);
		void Lean(ELeanDirection DesiredLeanDir, bool bClientSimulation);
		void ItemEnabledModeChanged(EDFItemEnabledMode PreviousItemEnabledMode);
		bool IsPrefiring();
		bool IsPlayer();
		bool IsPerspectiveMesh(class USkeletalMeshComponent* MeshCompToCheck);
		bool IsLeaning();
		bool IsFiring();
		bool IsEquipped();
		bool IsAlive();
		void GoProne(bool bClientSimulation);
		void GiveLoadout(class UDFLoadout* Loadout, bool bEquipFirstItem);
		class ADFBaseItem* GetRelevantEquippedItem();
		class ADFBaseItem* GetPreviousInventoryItem(bool bEquippable);
		class ADFBaseItem* GetNextInventoryItem(bool bEquippable);
		class UAnimMontage* GetMontageToUseFromPerspectiveAnimPair(const struct FPerspectiveAnim& AnimationPair);
		EDFItemEnabledMode GetItemEnabledMode();
		class FName GetItemAttachPoint();
		class UDFInventoryComponent* GetInventory();
		class ADFBaseItem* GetEquippedItem();
		bool GetDamageMultiplierByBoneName(const class FName& BoneName, float* DamageMultiplier);
		class USkeletalMeshComponent* GetCharacterMeshToUse(bool bIgnoreLocalControlOnServer);
		bool GetCharacterDeathMontageToUse(class UAnimMontage** OutCharDeathMontage);
		EVisibilityBasedAnimTickOption GetCharacterAnimTickOptionToUse(bool bVisibleMesh);
		class UAnimSequenceBase* GetAnimToUseFromPerspectiveAnimPair(const struct FPerspectiveAnim& AnimationPair);
		struct FRotator GetAimOffsets();
		void EquipPreviousItem();
		void EquipNextItemByType(EItemType ItemType);
		void EquipNextItem();
		void EquipItem(class ADFBaseItem* ItemToEquip);
		bool Die(float KillingDamage, const struct FDamageEvent& DamageEvent, class AController* Killer, class AActor* DamageCauser);
		void CrouchToggle();
		void ClientVeryShortAdjustPosition_CustomStamina(float Timestamp, const struct FVector& NewLoc, class UPrimitiveComponent* NewBase, const class FName& NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode, float ServerSprintStamina);
		void ClientAdjustRootMotionSourcePosition_CustomStamina(float Timestamp, const struct FRootMotionSourceGroup& ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, const struct FVector& ServerLoc, const struct FVector_NetQuantizeNormal& ServerRotation, float ServerVelZ, class UPrimitiveComponent* ServerBase, const class FName& ServerBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode, float ServerSprintStamina);
		void ClientAdjustRootMotionPosition_CustomStamina(float Timestamp, float ServerMontageTrackPosition, const struct FVector& ServerLoc, const struct FVector_NetQuantizeNormal& ServerRotation, float ServerVelZ, class UPrimitiveComponent* ServerBase, const class FName& ServerBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode, float ServerSprintStamina);
		void ClientAdjustPosition_CustomStamina(float Timestamp, const struct FVector& NewLoc, const struct FVector& NewVel, class UPrimitiveComponent* NewBase, const class FName& NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, unsigned char ServerMovementMode, float ServerSprintStamina);
		void ClearCharacterAnimInstances(bool bPerspectiveMeshOnly);
		bool CanVault();
		bool CanSprint();
		bool CanLean(ELeanDirection DesiredLeanDir);
		bool CanGoProne();
		bool CanDie(float KillingDamage, const struct FDamageEvent& DamageEvent, class AController* Killer, class AActor* DamageCauser);
		bool CanAim();
		void AimToggle();
		void Aim(bool bClientSimulation);
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseGameMode
	 * Size -> 0x00F0 (FullSize[0x03F8] - InheritedSize[0x0308])
	 */
	class ADFBaseGameMode : public AGameMode
	{
	public:
		class ADFGameSession*                                      DFGameSession;                                           // 0x0308(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_A350[0x8];                                   // 0x0310(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              TeamStateClass;                                          // 0x0318(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              AIControllerClass;                                       // 0x0320(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<unsigned char>                                      WinningTeams;                                            // 0x0328(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FTimerHandle                                        TimerHandle_DefaultTimer;                                // 0x0338(0x0008) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    WarmupTime;                                              // 0x0340(0x0004) Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    RoundTimeLimit;                                          // 0x0344(0x0004) Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    RoundScoreLimit;                                         // 0x0348(0x0004) Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    TimeBetweenMatches;                                      // 0x034C(0x0004) Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bBalanceTeams : 1;                                       // 0x0350(0x0001) BIT_FIELD Edit, Config, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VVSJ[0x3];                                   // 0x0351(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BalanceTimerInterval;                                    // 0x0354(0x0004) Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              AutoAssignHumanTeam;                                     // 0x0358(0x0001) Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bBotAutofill : 1;                                        // 0x0359(0x0001) BIT_FIELD Edit, BlueprintVisible, Config, GlobalConfig, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_BC2A[0x6];                                   // 0x035A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FText                                                GameDisplayName;                                         // 0x0360(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		int32_t                                                    NumTeams;                                                // 0x0378(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowUnassignedTeams : 1;                               // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowPlayerNameChanges : 1;                             // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowPlayerNameChangesUnderNullOSS : 1;                 // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowPlayerNameChangesUnderSteamOSS : 1;                // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAlwaysDestroyPlayerDuringSeamlessTravel : 1;            // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bForceRespawn : 1;                                       // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRandomSpawns : 1;                                       // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRestartPlayerAtTransformOnly : 1;                       // 0x037C(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bFriendlyFire : 1;                                       // 0x037D(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bUpdatePlayerGameplayMuteStates : 1;                     // 0x037D(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bTeamOnlyVoice : 1;                                      // 0x037D(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESpawnActorCollisionHandlingMethod                         DefaultPawnSpawnCollisionHandlingMethodOverride;         // 0x037E(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowBots : 1;                                          // 0x037F(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FTimerHandle                                        TimerHandle_BalanceTimer;                                // 0x0380(0x0008) BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              GameRulesetClasses[0x50];                                // 0x0388(0x0050) UNKNOWN PROPERTY: SetProperty
		TArray<class AActor*>                                      SignificantActors;                                       // 0x03D8(0x0010) ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TArray<class UDFGameRulesetBase*>                          GameRulesets;                                            // 0x03E8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void UpdatePlayerGameplayMuteStates(class ADFBasePlayerController* ForPlayerController);
		void UnregisterSignificantActor(class AActor* ActorToRemove);
		void SwitchToNextMap();
		void SignificantActorEndPlay(class AActor* RemovedActor, EEndPlayReason EndPlayReason);
		bool ShouldHibernate();
		bool ShouldGameplayMuteRemotePlayer(class ADFBasePlayerController* ForPlayer, class ADFBasePlayerController* PlayerToCheck);
		bool ShouldBotAutofill();
		void RemoveTeamBots(unsigned char TeamId, int32_t Num);
		void RemovePlayerByAge(bool bNewest, bool bExcludeBots, bool bExcludeHumans);
		void RemoveOldestPlayer();
		void RemoveOldestBot();
		void RemoveNewestPlayer();
		void RemoveNewestBot();
		bool RemoveBotByName(const class FString& PlayerName);
		bool RemoveBot(class APlayerState* BotPS);
		void RemoveAllBots();
		void RegisterSignificantActor(class AActor* ActorToRegister);
		void ReceiveOnSwapAIControllers(class AAIController* OldAIC, class AAIController* NewAIC);
		void ReceiveOnMatchIsWaitingToStart();
		void ReceiveOnMatchHasStarted();
		void ReceiveOnMatchHasEnded();
		void ReceiveOnMatchAborted();
		void ReceiveOnLeavingMap();
		bool PlayerCanRestartGeneric(class AController* Player);
		bool PlayerBotCanRestart(class AAIController* Player);
		void NextMap();
		float ModifyDamage(float Damage, class AActor* DamagedActor, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);
		bool KickPlayerByName(const class FString& KickedPlayerName, const class FText& KickReason);
		bool KickPlayerById(int32_t KickedPlayerId, const class FText& KickReason);
		bool IsValidTeamId(unsigned char TeamId);
		bool IsMatchWinner(class ADFBasePlayerState* PlayerStateToCheck);
		bool IsHibernating();
		bool IsFriendlyFireEnabled();
		int32_t GetTotalNumPlayers(bool bIncludeTravellingPlayers);
		int32_t GetNumPlayersOnTeam(unsigned char TeamId, EPlayerKind PlayerType);
		class FString GetNextMapName();
		class FString GetNextGameName();
		unsigned char GetAutoAssignHumanTeam();
		bool ForceTeamId(int32_t SwitchedPlayerId, unsigned char TeamIdToAssign);
		bool ForceTeam(const class FString& SwitchedPlayerName, unsigned char TeamIdToAssign);
		bool FindPlayerStartTransform(class AController* Player, struct FTransform* OutFoundSpawnTransform, const class FString& IncomingName);
		void DumpActiveRulesets();
		void DetermineMatchWinner();
		class ADFTeamState* CreateTeam(class UDFTeamDefinition* NewTeamDef, unsigned char NewTeamIdToUse);
		unsigned char ChooseTeam(class ADFBasePlayerState* ForPlayerState);
		bool ChooseSpawnPointFromPlayerStart(class AController* Player, class AActor* StartSpot, struct FSpawnPointDef* OutChosenSpawnPoint, ESpawnActorCollisionHandlingMethod* OutCollisionHandlingMethod);
		bool CheckWinConditions();
		bool CheckRulesetWinConditions();
		bool CanRegisterSignificantActor(class AActor* ActorToRegister, class FString* ActorDenialReason);
		bool CanDealDamage(class ADFBasePlayerState* DamageInstigator, class ADFBasePlayerState* DamagedPlayer);
		bool CanAddRuleset(class UClass** RulesetClassToAdd, class FString* RulesetDenialReason);
		bool BanPlayerByName(const class FString& BannedPlayerName, const class FText& BanReason, float BanDuration);
		bool BanPlayerById(int32_t BannedPlayerId, const class FText& BanReason, float BanDuration);
		void AutofillWithBots();
		void AssignTeam(class AController* ForController, unsigned char AssignedTeam);
		void AddTeamBots(unsigned char TeamId, int32_t Num);
		void AddNamedBot(const class FString& BotName);
		void AddBots(int32_t Num);
		class APlayerState* AddBot(unsigned char PlayerTeamID, const class FString& PlayerName);
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseGame_DeathMatch
	 * Size -> 0x0008 (FullSize[0x0400] - InheritedSize[0x03F8])
	 */
	class ADFBaseGame_DeathMatch : public ADFBaseGameMode
	{
	public:
		class ADFBasePlayerState*                                  WinningPlayerState;                                      // 0x03F8(0x0008) Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseGame_TeamDeathMatch
	 * Size -> 0x0000 (FullSize[0x03F8] - InheritedSize[0x03F8])
	 */
	class ADFBaseGame_TeamDeathMatch : public ADFBaseGameMode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseGameInstance
	 * Size -> 0x00B8 (FullSize[0x0250] - InheritedSize[0x0198])
	 */
	class UDFBaseGameInstance : public UGameInstance
	{
	public:
		unsigned char                                              UnknownData_L3PF[0x90];                                  // 0x0198(0x0090) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnPlayerStateTalkingStateChanged;                        // 0x0228(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_WCOU[0x18];                                  // 0x0238(0x0018) MISSED OFFSET (PADDING)

	public:
		void ProjectVersion();
		void OnTravelFailure(class UWorld* World, ETravelFailure FailureType, const class FString& ErrorString);
		void OnNetworkLagStateChanged(class UWorld* World, class UNetDriver* NetDriver, ENetworkLagState LagType);
		void OnNetworkFailure(class UWorld* World, class UNetDriver* NetDriver, ENetworkFailure FailureType, const class FString& ErrorString);
		void JoinGameByIP(const class FString& IPAddress, const class FString& JoinPassword);
		void JoinGame(int32_t SearchResultIndex, const class FString& JoinPassword);
		bool IsHibernating();
		void HostGame(const class FString& TravelURL, bool bLANGame, int32_t MaxPlayers, const class FString& HostName, const class FString& Password);
		void ForceUpdateSession();
		void FindGames(ESessionSearchPresenceType SearchPresenceType);
		void DumpOnlineSessionState();
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseGameState
	 * Size -> 0x0070 (FullSize[0x0300] - InheritedSize[0x0290])
	 */
	class ADFBaseGameState : public AGameState
	{
	public:
		unsigned char                                              NumTeams;                                                // 0x0290(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       bTimerPaused;                                            // 0x0291(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_8E96[0x2];                                   // 0x0292(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    RemainingTime;                                           // 0x0294(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    ReplicatedRemainingTime;                                 // 0x0298(0x0004) Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Y037[0x4];                                   // 0x029C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<float>                                              TeamScores;                                              // 0x02A0(0x0010) Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class ADFTeamState*>                                TeamArray;                                               // 0x02B0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTeamStateAdded;                                        // 0x02C0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTeamStateRemoved;                                      // 0x02D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerStateAdded;                                      // 0x02E0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerStateRemoved;                                    // 0x02F0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		void SetTimerPauseState(bool bNewPauseState);
		void SetRemainingTime(int32_t NewRemainingTime);
		void OnRep_ReplicatedRemainingTime();
		void OnRep_NumTeams();
		bool IsValidTeamId(unsigned char TeamId);
		class ADFTeamState* GetTeamStateById(unsigned char TeamIdNum);
		static UClass* StaticClass();
	};

	/**
	 * Class DonkehFramework.DFBaseWeapon
	 * Size -> 0x0298 (FullSize[0x0640] - InheritedSize[0x03A8])
	 */
	class ADFBaseWeapon : public ADFBaseItem
	{
	public:
		class FScriptMulticastDelegate                             OnFire;                                                  // 0x03A8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		bool                                                       bFiring : 1;                                             // 0x03B8(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       UnknownData_DHJS : 3;                                    // 0x03B8(0x0001) BIT_FIELD (PADDING)
		bool                                                       bReadyToFirePendingRelease : 1;                          // 0x03B8(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bFireOnRelease : 1;                                      // 0x03B8(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_80Y5[0x3];                                   // 0x03B9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      PrefireDelayMin;                                         // 0x03BC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bPrefiring : 1;                                          // 0x03C0(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, Transient, EditConst, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_0LZP[0x3F];                                  // 0x03C1(0x003F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bADSFireOnly : 1;                                        // 0x0400(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bLastShotFired : 1;                                      // 0x0400(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, Transient, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       bRepCounterPending : 1;                                  // 0x0400(0x0001) BIT_FIELD Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_7MLB[0x1];                                   // 0x0401(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRepShotInfo                                        FireCounter;                                             // 0x0402(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, RepNotify, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected
